public class Main {
    public static void main(String[] args) {
        /**
         Задания на темы : For, while, do while,
         Arrays void method, return method
         GOOD LUCK!!! 30 заданий.
         Made by A.ZH
         1. Напишите класс, который создает 20 случайных чисел диапазона
         1 - 99. Следует вывести в консоль только те числа которые делятся
         на 1-ое рандомное число без остатка.
         - Нельзя использовать массив.
         2. Напишите класс, который генерирует 20 рандомных целых чисел
         из диапазона -50 до +50, и определяет наименьшее число и
         наибольшее число.
         - Нельзя использовать массив
         3. Напишите класс, который принимает с консоли для переменной X
         целое положительное число, а затем дополнительно будет
         спрашивать ещё числа, эти числа будут должны вычитаться из
         переменной x, вы будете вводить числа до тех пор пока X не будет
         отрицательным или равен 0.
         - используйте while loop
         4. Напишите класс, который принимает с клавиатуры две
         переменный это два числа, пока не будет введено две одинаковых
         чисел.
         Класс должен выводить на экран сумму всех первых чисел и сумму
         всех вторых чисел (не считая чисел, введенных одинаковыми).
         5. Напишите класс, который принимает с клавиатуры целое число
         любой длины и выводит на экран:
         ● в первой строке - все четные цифры этого числа, через пробел
         ● во второй строке - все нечетные цифры этого числа, через
         пробел
         Например, для числа 765873 в первой строке будет выведены числа
         6 8, а во второй строке 7 5 7 3
         - Нельзя использовать массив
         6. Напишите класс, который принимает с клавиатуры целое
         положительное число любой длины, а затем выводит его первую
         цифру.
         Например, для числа 7659 на экран будет выведено 7.
         7. Напишите класс, который принимает с клавиатуры целое число
         любой длины и строит из него число с обратным порядком цифр.
         Новое значение следует вывести в консоль.
         8. На спектакль в кассу театра было выделено определенное
         количество билетов, и продажа осуществлялась до тех пор, пока не
         были проданы все билеты.
         Напишите класс, который сначала принимает с клавиатуры
         количество билетов, переданных в кассу. Затем класс принимает с
         клавиатуры серию чисел, каждое из которых указывает на число
         билетов, которое желает приобрести покупатель.
         Если нет возможности продать очередному покупателю требуемое
         им число билетов, принимается заказ от следующего покупателя.
         Класс должен вывести в консоль:
         ● Какое число покупателей приобрели билеты
         ● Какому числу покупателей было отказано в продаже билетов
         9. Напишите класс, который заполняет случайными
         четырехзначными числами массив, размер которого вводится с
         клавиатуры.
         После заполнения класс должен вывести на экран значения
         массива в одной строке, начиная с конца массива ( с последнего
         индекса).
         10. Напишите класс, который заполняет случайными двузначными
         числами массив, размер которого вводится с клавиатуры.
         После заполнения класс должен вывести на экран значения
         массива следующим образом:
         ● в первой строке - первую половину массива
         ● во второй строке - вторую половину массива
         11. Напишите класс, который заполняет случайными двузначными
         числами массив, размер которого вводится с клавиатуры.
         После заполнения класс должен вывести на экран значения
         массива следующим образом:
         ● в первой строке – четные значения, содержащиеся в массиве
         ● во второй строке – нечетные значения, содержащиеся в
         массиве
         12. Создайте не возвращающий метод в параметры которого, вы
         даете массив из целых чисел и еще целое число n.
         Метод должен проверить есть ли в массиве число большее или
         равное n.
         Если есть такое число вывести в консоль true, в другом случае false!
         13. Напишите не возвращающий метод, который берет в параметры
         массив из boolean типа, и выводит в консоль количество true
         элементов массива.
         14. Напишите не возвращающий метод который в параметры берет
         массив из рандомных чисел от 1 до 50 и выводит в консоль только
         те числа что больше 20.
        15. Напишите не возвращающий метод, который берет массив из
         рандомных чисел от 1 до 50 и еще одно целое число n.
         Нужно вывести в консоль сколько раз число n повторялось в
         массиве.
         16. Напишите метод возвращающий тип int, вы должны в параметры
         метода дать целое положительное число n.
         А метод нам вернёт сумму всех цифр от 0 до n.
         17. Напишите метод, который принимает в качестве параметра
         массив целых чисел и число К, число К это индекс в массиве.
         Нам нужно вывести сумму всех чисел до индекса K массива.
         18. Напишите возвращающий метод типа массива int, который в
         параметры принимает массив и возвращает новый массив
         состоящий только из четных элементов массива А.
         19. Напишите возвращающий метод типа String, который в качества
         параметра прнинимает число, и возвращает день недели как слово
         String.
         (Можно использовать switch or if else)
         20. Напишите не возвращающий метод который получает в качестве
         параметра не заполненный массив с размером 15.
         Нужно массив заполнить положительными случайными
         двузначными четными числами.
         И вывести элементы массива в консоль в одну строку через пробел.
         21. Напишите возвращающий метод типа массива char [], который в
         качестве параметра берет число n и boolean b.
         Число n означает количество букв для заполнения, если booelan b
         будет true, то нужно вернуть char[] массив состоящий из n заглавных
         букв, если же false то прописными буквами (маленькими).
         22. Напишите возвращающий метод типа boolean, который в
         качестве параметра берет заполненный массив именами, и String
         name.
         Нам нужно в массиве найти 2-ой параметр name, если мы его
         нашли и его индекс это четное число то вернуть true, в иных случаях
         вернуть false.
         23. Напишите возвращающий метод типа массива int[] который
         берет в параметр число n, мы внутри метода создадим массив int[]
         размером n.
         Нам нужно сгенерировать рандомные числа массиву так чтобы
         каждое следующее число было больше предыдущей.
         24. Напишите метод возвращающий тип boolean , который
         принимает в качестве параметра массив целых чисел и проверяет,
         являются ли все элементы массива положительными числами.
         Если все элементы положительные то вернуть true, в других случая
         вернуть false.
         25. Дан массив состоящий из целых положительных чисел, и целое
         число n.
         Массив можно вручную заполнить (не сканнер), целое число n тоже
         можно дать вручную.
         Нужно найти с помощью суммы каких двух чисел массива мы можем
         получить число n, если есть такие числа нужно вернуть их индексы,
         если таких нет то вывести на экран таких нету.
         Пример: массив -> {2, 7, 11, 15, 45}, число n -> 9
         Нужно получить {0, 1} -> это индексы чисел с помощью суммы
         которых можно получить число n
         Пример: массив -> {3, 2, 4}, число n -> 6
         Нужно получить {1, 2} -> это индексы чисел с помощью суммы
         которых можно получить число n
         Пример: массив -> {3, 3}, число n -> 6
         Нужно получить {0, 1} -> это индексы чисел с помощью суммы
         которых можно получить число n
         Пример: массив -> {2, 7, 11, 15, 45}, число n -> 14
         Нужно получить -1
         26. Напишите возвращающий метод типа boolean, который в
         качестве параметра берет массив из положительных чисел.
         Если в массиве всего 5 чисел равных 2, то вывести true, а в
         остальных случая false.
         27. Напишите возвращающий метод типа String, который в качестве
         параметра берет String word и целое положительное число n.
         Нужно создать такой String в котором word будет повторяться n раз,
         и в конце надо этот String вернуть.
         Пример: “Hi”, 4 -> “HiHiHiHi”
         28. Напишите возвращающий метод типа boolean, который в
         качестве параметров принимает массив целых чисел.
         Верните значение true, если последовательность чисел 1, 2, 3 где-то
         появляется в массиве.
         29. Напишите возвращающий метод типа boolean, который в
         качестве параметра принимает наполненный положительными
         числами массив.
         Верните значение true, если один из первых 4 элементов в массиве
         равен 9. Длина массива может быть меньше 4.
         30. Напишите возвращающий метод типа boolean, который в
         качестве параметра принимает наполненный положительными
         числами массив.
         Верните значение true, если в массиве встречаются 3 одинаковых
         числа подряд, в ином случае false.
         You are the best students!
         Кудай буйруса практика кылсаныздар баары
         колдон келет!!!
         */
    }
}